{
  "version": "1.0",
  "created_at": "2025-12-22T20:57:44.934775",
  "memos": [
    {
      "id": "ad3b8d9f-2218-4805-ab8e-06e1debcabde",
      "memo_type": "Short Memo - Co-investimento (Search Fund)",
      "company_name": "Syonet Informática Ltda.",
      "memo_name": "Syonet Informática Ltda. - Short Memo - Co-investimento (Search Fund)",
      "saved_at": "2026-02-05T15:27:29.594474",
      "updated_at": "2026-02-05T15:27:29.594474",
      "sections": [
        {
          "section_name": "Introdução",
          "paragraphs": [
            "A Atlante Capital Search Fund (search fund brasileiro liderado por Daniel Werner Corrêa) está avaliando a aquisição da Syonet Informática Ltda., companhia especializada em soluções de CRM para concessionárias automotivas, com sede em São Paulo. A Syonet é reconhecida como uma das principais plataformas de gestão de relacionamento com clientes no segmento automotivo brasileiro, oferecendo integrações nativas com portais automotivos e um integrador de estoques para gerenciamento de anúncios, atendendo grandes grupos de concessionárias no país.",
            "A aquisição contempla 100% do equity da Syonet por R$ 72m (8,0x EBITDA 2024), estruturados integralmente à vista. Adicionalmente, a transação prevê um earnout de até R$ 18m vinculado ao atingimento de metas de receita em 2024, a ser pago em três parcelas anuais entre 2025 e 2027. Os vendedores permanecerão na operação ao menos até 2024 como pré-condição para o recebimento dos pagamentos de earnout, garantindo continuidade operacional durante o período de transição."
          ],
          "generation_metadata": {}
        },
        {
          "section_name": "Mercado",
          "paragraphs": [
            "O mercado brasileiro de CRM e marketing digital SaaS para concessionárias é estimado em **R$ 1 bilhão**, considerando as mais de 55 mil lojas no país — das quais aproximadamente 7 mil são franqueadas de marca e 48 mil independentes. O segmento apresenta fortes tailwinds de digitalização, impulsionado pela mudança de comportamento dos compradores (Millennials e Geração Z) que favorecem cada vez mais a compra online de veículos, tendência acelerada pela pandemia de COVID-19. A **Syonet Informática Ltda.** se posiciona como líder de mercado, sendo a solução definitiva global em CRM para concessionárias, com presença em mais de 1.600 lojas e atuação como one-stop-shop integrando CRM, marketing digital e gestão de estoques.",
            "O mercado é altamente pulverizado, com os aproximadamente 70% restantes do segmento distribuídos entre lojas que utilizam planilhas de Excel (maior parte) e diversos sistemas genéricos de gestão de leads. A **Syonet Informática Ltda.** detém aproximadamente **20-22%** de market share no segmento de concessionárias franqueadas, enquanto competidores como Salesforce e RD Station possuem cerca de 5% cada. Apesar da liderança, a empresa enfrenta competidores relevantes como Salesforce (utilizado por conglomerados multissetoriais), RD Station (focado em marketing digital), além de players menores como Mr Sales, Followize, Pipedrive, Reweb, Mapsys, DuLeads, AdSet e Hubspot. O segmento adjacente de marketing digital para concessionárias também apresenta potencial de consolidação, com targets identificados como Dealersites (R$ 14M faturamento), Autoforce (R$ 6M), Reweb (R$ 30M) e Alpes One (R$ 10M).",
            "De acordo com o searcher, os principais diferenciais competitivos da **Syonet Informática Ltda.** são: (i) Integrações nativas com OEMs e DMS — a empresa levou duas décadas para desenvolver integrações proprietárias com sistemas legados das montadoras, que utilizam linguagens defasadas e não possuem APIs abertas, criando uma barreira tecnológica significativa para novos entrantes; (ii) Homologação com montadoras — processo que exige abertura de código pelas OEMs, concedido apenas a empresas estabelecidas e respeitadas no setor, além de relacionamento comercial no qual montadoras recomendam ativamente o uso do Syonet para suas redes franqueadas; (iii) Integrações nativas com portais automotivos — único CRM do nicho com conexões diretas com Webmotors, iCarros, OLX e outros portais, eliminando trabalho manual de gestão de leads; (iv) Integrador de estoques especializado — ferramenta que permite subir e gerenciar anúncios em múltiplos portais de forma unificada; (v) Base de clientes pulverizada — carteira diversificada na qual o maior cliente representa apenas 4% do faturamento, limitando riscos de concentração; (vi) Switching costs elevados — a complexidade das integrações e a curva de aprendizado do sistema criam custos de troca significativos para os clientes."
          ],
          "generation_metadata": {}
        },
        {
          "section_name": "Empresa",
          "paragraphs": [
            "Sediada em São Paulo, SP, a **Syonet Informática Ltda.** é a solução definitiva global em CRM para concessionárias automotivas, utilizada por grandes grupos franqueados no Brasil. Com receita atual de **R$ 32,5m** e **EBITDA de R$ 9,0m** (margem de **28%**), a companhia se posiciona como líder no nicho de CRM vertical para o setor automotivo, operando sob modelo 100% SaaS com alta recorrência de receita.",
            "O portfólio de produtos é composto por: (i) CRM Syonet, solução completa para concessionárias franqueadas com integrações nativas a sistemas de montadoras (OEMs) e DMS, (ii) módulo de Digital Marketing para gestão de campanhas e performance, e (iii) Leadstation, versão simplificada voltada ao mercado de revendas independentes. A margem bruta de **73%** reflete o modelo asset-light e a natureza de software como serviço. Os diferenciais competitivos incluem integrações nativas com portais automotivos (Webmotors, iCarros, OLX), integrador de estoques para gerenciamento unificado de anúncios, e automação de pós-vendas com chamadas programadas para revisões e recalls.",
            "A empresa construiu ao longo de duas décadas barreiras de entrada tecnológicas e comerciais significativas. A integração com sistemas de OEMs e DMS demanda desenvolvimento proprietário para cada linguagem e base de dados, processo que a Syonet levou 20 anos para consolidar. Além da dificuldade técnica, há necessidade de homologação junto às montadoras, que só abrem seus códigos para empresas estabelecidas e respeitadas no setor. Esta combinação de complexidade técnica e relacionamento comercial com OEMs cria switching costs elevados e lock-in de clientes.",
            "A base de clientes é pulverizada, com o maior cliente representando apenas **4%** do faturamento, limitando riscos de concentração. A operação conta com equipe de aproximadamente 120 colaboradores, distribuídos entre desenvolvimento (55 pessoas organizadas em 7 pods sob 3 Product Owners), Customer Success (41 pessoas entre implantação e suporte) e Sales & Marketing (19 pessoas). A estratégia de contratação é focada em pessoal de Customer Support, área menos complexa que serve como pipeline interno para formação de desenvolvedores através de programa estruturado de treinamento.",
            "O time de gestão é composto pelos founders, profissionais técnicos com mais de 20 anos de experiência no setor automotivo, incluindo passagens por empresas de DMS posteriormente adquiridas pela Linx. O CEO Aurélio Martins e o CFO Daniel Corrêa lideram as operações, enquanto o CPO Jordani Caldeira, o sócio mais jovem, demonstra interesse em permanecer na companhia no longo prazo, garantindo continuidade técnica e institucional."
          ],
          "generation_metadata": {}
        },
        {
          "section_name": "Financials",
          "paragraphs": [
            "Entre 2017 e 2021, o faturamento da **Syonet Informática Ltda.** apresentou CAGR de 33%, passando de R$ 10,5m para R$ 32,5m em receita líquida, impulsionado pela digitalização acelerada das concessionárias automotivas e pela expansão da base de clientes nas unidades de negócio de CRM e Digital Marketing. O EBITDA ajustado cresceu de R$ 4,0m para R$ 9,0m no mesmo período, demonstrando capacidade de escalar a operação mantendo rentabilidade.",
            "A margem bruta se mantém estável em torno de 73-75%, refletindo a natureza de software da operação com custos variáveis limitados a Customer Success e infraestrutura. A margem EBITDA ajustada, por sua vez, apresentou compressão de 38% (2017) para 28% (2021), explicada pelo sobredimensionamento da área de desenvolvimento (R&D representa 18% das vendas) devido à proliferação de novos produtos sem planejamento estratégico adequado. A diligência técnica da Spellbound validou oportunidade de otimização desta estrutura, com potencial de recuperação de margem sem novas contratações no primeiro ano pós-aquisição.",
            "A empresa opera com posição financeira saudável, sem dívida financeira relevante. O modelo de negócio SaaS apresenta características favoráveis de geração de caixa, com unit economics robustos: margem bruta de 78%+, LTV/CAC ratio superior a 7x e Net Revenue Retention médio de 124% nos últimos três anos, indicando forte capacidade de expansão dentro da base existente de clientes.",
            "No cenário base, o searcher projeta receita líquida de R$ 111,9m em 2027 (CAGR de 28% entre 2022 e 2027), sustentado pelo crescimento orgânico nas unidades de CRM e Digital Marketing, com penetração de digital marketing nos clientes de CRM ainda em apenas 18%. A margem EBITDA ajustada projetada expande para 35-38% na saída, refletindo ganhos de escala em SG&A e otimização da área de desenvolvimento. Com EBITDA de R$ 42,6m em 2027 e múltiplo de saída de 9-11x, o cenário base indica TIR líquida para investidores de 37-45% e MOIC de 4,9x-6,5x.",
            "As premissas de crescimento são conservadoras quando comparadas ao histórico: o CAGR projetado de 28% está em linha com o CAGR histórico de 32% (2018-2021), considerando apenas produtos existentes e mercado doméstico. O cenário pessimista, que assume desaceleração de crescimento e insucesso em novas frentes (independentes, Latam, novos produtos), ainda projeta receitas de R$ 87m em 2027, demonstrando robustez do negócio base. Os números de 2021 são gerenciais, com ajustes de EBITDA já confirmados na diligência financeira Fase I, e Quality of Earnings adicional prevista para validação final."
          ],
          "generation_metadata": {}
        },
        {
          "section_name": "Transação/Oportunidade",
          "paragraphs": [
            "A aquisição contempla **100%** do equity da **Syonet Informática Ltda.** a um EV de **R$ 72M** (**8,0x** EBITDA 2024). A estrutura da transação inclui pagamento à vista de **R$ 72M** e earnout de até **R$ 18M** condicionado ao atingimento de receitas em 2024, a ser pago em três parcelas anuais entre 2025-2027. Com o pagamento integral do earnout, o múltiplo de entrada subiria para aproximadamente **10,0x** EBITDA.",
            "O preço de entrada negociado parece adequado para uma empresa de software vertical com métricas SaaS sólidas, considerando o múltiplo equivalente de **2,2x** EV/Receitas. A estrutura de earnout vinculada a metas de receita de 2024 demonstra alinhamento de interesses com os vendedores, que permanecerão na operação até o cumprimento das condições. A aquisição será realizada sem endividamento, preservando flexibilidade financeira para investimentos em crescimento e eventuais aquisições complementares. Os pagamentos diferidos do earnout serão integralmente financiados pelos fluxos de caixa da própria companhia, com correção pelo IPCA.",
            "Considerando o cenário base do searcher com CAGR de receita de **28%**, margem EBITDA de **38%** e saída em **2027** a **15,4x** EBITDA, os retornos projetados são de **6,0x+ MOIC** e **43%+ IRR**. O searcher assume crescimento acelerado suportado por forte NRR histórico de **124%+**, expansão em mercados adjacentes (independentes e Latam) e lançamento de novos produtos. O múltiplo de saída elevado reflete a expectativa de consolidação do setor, com precedentes recentes como a aquisição da CDK Global pela Brookfield em abril de 2022.",
            "Os principais upsides incluem a penetração ainda baixa de digital marketing na base existente (apenas **18%**), o potencial de expansão para América Latina e o SAM de **R$ 1bi** no mercado core com **R$ 2bi** adicionais em produtos e geografias adjacentes. Os riscos da tese concentram-se na execução das novas avenidas de crescimento e na capacidade de escalar a equipe de desenvolvimento, embora o negócio existente apresente fundamentos robustos com carteira pulverizada (maior cliente representa apenas **4%** do faturamento) e fortes barreiras competitivas."
          ],
          "generation_metadata": {}
        },
        {
          "section_name": "Pontos a Aprofundar",
          "paragraphs": [
            "- Validar as condições do earnout de R$ 18mm vinculado a receitas de 2024, entendendo métricas específicas, gatilhos de pagamento e potenciais disputas nas 3 parcelas anuais (2025-27)",
            "- Aprofundar na estrutura da transação para confirmar que passivos tributários identificados (IRPF de Alexandre Bello, IPTU de Leandro Alberto) e contingências das Related Companies não impactarão a empresa pós-aquisição",
            "- Entender o status da migração de clientes para versão Cloud e conversão para arquitetura multi-tenant, validando timeline de 1 ano e impacto em escalabilidade e custos",
            "- Validar se a licença comercial do iText foi efetivamente contratada pelos vendedores antes do Closing, conforme obrigação do SPA, e confirmar documentação da Oracle sobre uso do OJDBC",
            "- Aprofundar nas premissas do cenário pessimista (R$ 87mm em 2027, 2,5x atual) para validar se crescimento de market share de 50% é realista dado histórico e dinâmica competitiva com Dealersites, Autoforce, Reweb e Alpes One",
            "- Entender a estratégia de descontinuação de produtos sem sentido comercial (Automatch, VideoMotors, Girocar) e impacto na equipe de desenvolvimento sobredimensionada para expansão de margem EBITDA de 28%",
            "- Definir plano de contratação do controller financeiro e coordenador de RH, validando timeline e perfil necessário para suportar crescimento e governança pós-aquisição",
            "- Validar a composição final do Board (Kinderhook, Cerralvo, Kviv, conselheiro independente) e alinhamento de incentivos com a tese de expansão Latam e novos produtos",
            "- Validar a composição final do Board (Kinderhook, Cerralvo, Kviv, conselheiro independente) e alinhamento de incentivos com a tese de expansão Latam e novos produtos"
          ],
          "generation_metadata": {}
        }
      ],
      "facts_snapshot": {
        "identification": {
          "company_name": "Syonet Informática Ltda.",
          "searcher_name": "Daniel Werner Corrêa",
          "business_description": "Syonet é a solução definitiva global em CRM para concessionárias, utilizada por grandes grupos de concessionárias no Brasil. A empresa oferece integrações nativas com portais automotivos e um integrador de estoques para gerenciar anúncios.",
          "investor_nationality": "brasileiro",
          "fip_casca": "Atlante Capital Search Fund",
          "company_location": "São Paulo, SP",
          "deal_context": "Atlante Capital está em processo de aquisição das quotas da Syonet Informática Ltda., Syoserv Assessoria em Informática Ltda. e Lead Force Ltda. - ME. A oportunidade surgiu no contexto de um mercado aquecido para sistemas de gestão de concessionárias e ferramentas de marketing digital no Brasil.",
          "search_start_date": ""
        },
        "transaction_structure": {
          "currency": "BRL",
          "stake_pct": 100.0,
          "ev_mm": 72.0,
          "equity_value_mm": 72.0,
          "multiple_ev_ebitda": 8.0,
          "multiple_reference_period": "2024.0",
          "cash_payment_mm": 72.0,
          "earnout_mm": 18.0,
          "earnout_conditions": "linked to 2024 revenues and paid in 3 annual installments between 2025-27",
          "total_transaction_value_mm": 72.0,
          "earnout_timeline": "3 annual installments, beginning in 2025",
          "multiple_total": 0.0,
          "cash_pct_total": 0.0,
          "equity_cash_mm": 0.0,
          "seller_note_mm": 0.0,
          "seller_note_pct_total": 0.0,
          "seller_note_tenor_years": 0.0,
          "seller_note_index": "",
          "seller_note_frequency": "",
          "seller_note_grace": "",
          "seller_note_terms": "",
          "step_up_mm": 0.0,
          "acquisition_debt_mm": 0.0,
          "acquisition_debt_rate": "",
          "acquisition_debt_tenor_years": 0.0,
          "acquisition_debt_institution": "",
          "leverage_resulting_x": 0.0,
          "investor_opinion": ""
        },
        "financials_history": {
          "revenue_current_mm": 32.5,
          "revenue_base_year": 2017,
          "revenue_base_year_mm": 10.462,
          "ebitda_current_mm": 8.989,
          "ebitda_margin_current_pct": 28.0,
          "ebitda_base_year_mm": 4.016,
          "gross_margin_pct": 73.0,
          "opex_pct_revenue": 41.0,
          "financials_commentary": ""
        },
        "saida": {
          "cenario_base_ano_saida": 2027.0,
          "cenario_base_cagr_receita_pct": 28.0,
          "cenario_base_margem_ebitda_pct": 38.0,
          "cenario_base_multiplo_saida_x": 15.4,
          "cenario_base_multiplo_saida_ano": 2027.0,
          "cenario_base_dividend_yield_pct": 0.0,
          "cenario_base_tir_pct": -100.0,
          "cenario_base_moic": 0.0,
          "cenario_alternativo_ano_saida": 2020.0,
          "cenario_alternativo_cagr_receita_pct": 0.0,
          "cenario_alternativo_margem_ebitda_pct": 0.0,
          "cenario_alternativo_multiplo_saida_x": 0.0,
          "cenario_alternativo_multiplo_saida_ano": 2020.0,
          "cenario_alternativo_dividend_yield_pct": 0.0,
          "cenario_alternativo_tir_pct": -100.0,
          "cenario_alternativo_moic": 0.0,
          "saida_observacoes": "",
          "growth_drivers": "",
          "projections_commentary": "",
          "exit_strategy": "",
          "value_creation_drivers": "",
          "exit_commentary": ""
        },
        "qualitative": {
          "business_model": "A estratégia de contratação é focada em pessoal de Customer Support (call center e implantação), que é uma área menos complexa e que demanda menor preparo técnico dos entrantes.",
          "competitive_advantages": "Fortes diferenciais competitivos e barreiras de entrada tecnológicas e comerciais.",
          "market_overview": "No segmento de marketing digital há diversas empresas principalmente focadas na parte de serviços gerenciados de marketing para concessionárias, que poderiam ser boas adições especialmente pelo seu portfólio de clientes. É um segmento bastante pulverizado e com potencial de consolidação.",
          "key_risks": "O principal risco relacionado ao investimento é de execução das novas avenidas de crescimento.",
          "management_team": "A Syonet conta hoje com talento acima da média entre seus desenvolvedores, tendo recebido uma nota acima da média no Spellbound scorecard, especialmente no quesito Pessoas.",
          "growth_strategy": "Abertura de uma filial em outro país traz consigo um aumento na complexidade do business, do ponto de vista comercial/operacional e também financeiro, auditoria etc.",
          "qualitative_commentary": "A empresa possui um programa de treinamento com aulas periódicas para o pessoal de Customer Success que deseja avançar para a área de desenvolvimento.",
          "main_competitors": "Dealersites, Autoforce, Reweb, Alpes One",
          "competitor_count": "4.0",
          "market_fragmentation": "pulverizado",
          "market_share_pct": 0.0,
          "next_steps": ""
        },
        "opinioes": {
          "key_strengths": "A Syonet possui uma trajetória sólida de crescimento com um CAGR de mais de 33% ao ano e EBITDA superior a 30%. A empresa também apresenta uma economia unitária superior, com margens brutas acima de 78% e uma relação LTV/CAC superior a 7x, além de um NRR médio de 124% nos últimos 3 anos. A solução é bem construída, altamente escalável e não requer grandes esforços de manutenção.",
          "key_concerns": "A integração com sistemas OEMs e DMS é uma grande dificuldade tecnológica devido à antiguidade e falta de APIs dos sistemas. Além disso, a empresa utiliza uma licença open source para o iText que não poderia, necessitando comprar a licença comercial.",
          "investment_rationale": "A Syonet apresenta uma trajetória sólida com crescimento de mais de 33% ao ano e EBITDA superior a 30%. A empresa possui uma economia unitária superior, com margens brutas acima de 78% e uma relação LTV/CAC superior a 7x, além de um NRR médio de 124% nos últimos 3 anos, proporcionando uma plataforma poderosa para crescimento contínuo. Além disso, há um potencial de retorno elevado com 6x+ cash on cash e 43% de IRR líquido para investidores no cenário base.",
          "market_reputation": "A Syonet é reconhecida no mercado, com grandes grupos de concessionárias como clientes, e é recomendada pelas OEMs devido à qualidade e bom funcionamento do sistema."
        }
      },
      "statistics": {
        "total_sections": 6,
        "total_paragraphs": 28,
        "word_count": 1928,
        "total_examples_used": 0
      },
      "tags": [],
      "notes": ""
    }
  ]
}